#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + implicit_flow_enabled                     = false
      + name                                      = "EMACCS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_citizen"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://emaccs.hlth.gov.bc.ca/*",
          + "https://logon7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.keycloak_openid_user_attribute_protocol_mapper.bceid_user_guid will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "bceid_user_guid" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "siteminder_user_guid"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "bceid_user_guid"
      + realm_id             = "moh_citizen"
      + user_attribute       = "bceid_user_guid"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.keycloak_openid_user_attribute_protocol_mapper.idir_user_guid will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_user_guid" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "siteminder_user_guid"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_user_guid"
      + realm_id             = "moh_citizen"
      + user_attribute       = "idir_user_guid"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["CA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Clinical Advisor"
      + id          = (known after apply)
      + name        = "CA"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["CCA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Continuing Competence Analyst"
      + id          = (known after apply)
      + name        = "CCA"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["DIRECTOR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Director"
      + id          = (known after apply)
      + name        = "DIRECTOR"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["READONLY"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Read Only"
      + id          = (known after apply)
      + name        = "READONLY"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["SYSADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "System Administrator"
      + id          = (known after apply)
      + name        = "SYSADMIN"
      + realm_id    = "moh_citizen"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*